// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
let arr1 = ['a', 'b', 'c'];
for (let i = 1; i < 4; i++) {
    arr1.push(i);
}
console.log(arr1);
//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
arr2 = [1, 2, 3];
arr2.reverse();
console.log(arr2);

//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
let arr3 = [1, 2, 3];
for (let i = 4; i < 7; i++) {
    arr3.push(i);
}
console.log(arr3);
//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
let arr4 = [1, 2, 3];
for (let i = 6; i > 3; i--) {
    arr4.unshift(i);
}
console.log(arr4);
//------------------------------------------------------------------------------------------------------------
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
let arr5 = ['js', 'css', 'jq'];
console.log(arr5.shift());
//------------------------------------------------------------------------------------------------------------
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
let arr6 = ['js', 'css', 'jq'];
let lastElement = arr6.pop();
console.log(lastElement);

//або
let arr7 = ['js', 'css', 'jq'];
console.log(arr7.pop());
//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
let arr8 = [1, 2, 3, 4, 5];

for (let i = 0; i < 3; i++) {
    arr8.shift();
}
console.log(arr8);
//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
let arr9 = [1, 2, 3, 4, 5];

for (let i = 0; i < 3; i++) {
    arr9.pop();
}
console.log(arr9);
//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let arr10 = [1, 2, 3, 4, 5];
let number5 = arr10.pop();
let number4 = arr10.pop();
arr10.push('a');
arr10.push('b');
arr10.push('c');
arr10.push(number4)
arr10.push(number5);
console.log(arr10);

//або

let arr11 = [1, 2, 3, 4, 5];
let NewArr = arr11.slice(0, 3);
NewArr.push('a');
NewArr.push('b');
NewArr.push('c');
NewArr.push(4);
NewArr.push(5);
console.log(NewArr);

//Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри

//------------------------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
let arr12 = [1, 2, 3, 4, 5];
let numb5 = arr12.pop();
let numb4 = arr12.pop();
let numb3 = arr12.pop();
let numb2 = arr12.pop();
arr12.push('a');
arr12.push('b');
arr12.push(numb2);
arr12.push(numb3);
arr12.push(numb4);
arr12.push('c');
arr12.push(numb5);
arr12.push('e');
console.log(arr12);

//------------------------------------------------------------------------------------------------------------
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
let arr13 = [1, 10, 2, 5, 11, 6, 22, 23, 28, 30];
for (const value of arr13) {
    if (value % 2 === 0) {
        console.log(value);
    }
}
//------------------------------------------------------------------------------------------------------------
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу
// та push () скопіювати значення одного масиву в інший
let arr14 = [1, 10, 2, 5, 11, 6, 22, 23, 28, 30];
let newArreys = [];
for (const value of arr14) {
    newArreys.push(value);
}
console.log(newArreys);

//------------------------------------------------------------------------------------------------------------
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
let arr15 = [1, 10, 2, 5, 11, 6, 22, 23, 28, 30];

for (let i = 0; i < 10; i++) {
    arr15.shift();
}
let newArreys1 = arr15;
console.log(newArreys1);

//------------------------------------------------------------------------------------------------------------
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
let arr16 = [1, 10, 2, '5', 11, 6, 22, '23', true, 28, 30];
let newArr2 = [];
for (let i = 10; i >= 0; i--) {
    newArr2.unshift(arr16[i]);
}
console.log(newArr2);


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while

let arr17 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let j = 0;
while (j < arr17.length) {
    console.log(arr17[j]);
    j++;
}


//     2. перебрати його циклом for
for (let value of arr17) {
    console.log(value);
}

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
j = 0;
while (j < arr17.length) {
    if (j % 2 !== 0) {
        console.log(arr17[j]);
    }
    j++;
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let i = 0; i < arr17.length; i++) {
    if (i % 2 !== 0) {
        console.log(arr17[i])
    }
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
j = 0;
while (j < arr17.length) {
    if (j % 2 === 0) {
        console.log(arr17[j]);
    }
    j++;
}


// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let i = 0; i < arr17.length; i++) {
    if (i % 2 === 0) {
        console.log(arr17[i]);
    }
}


// 7. замінити кожне число кратне 3 на слово "okten"
for (let i = 0; i < arr17.length; i++) {
    if (i % 3 === 0) {
        arr17[i] = "okten";

    }
}
console.log(arr17);


// 8. вивести масив в зворотньому порядку.
let arr18 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
arr18.reverse();
console.log(arr18);


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

//     1. перебрати його циклом while в зворотньому порядку

let arr19 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let k = 9;
while (k >= 0) {
    console.log(arr19[k]);
    k--;
}


//     2. перебрати його циклом for в зворотньому порядку
for (let i = 9; i >= 0; i--) {
    console.log(arr19[i]);
}

//     3. перебрати циклом while в зворотньому порядку та вивести  числа тільки з непарним індексом
k = 9;
while (k >= 0) {
    if (k % 2 !== 0) {
        console.log(arr19[k]);
    }
    k--;

}

// 4. перебрати циклом for в зворотньому порядку та вивести  числа тільки з непарним індексом

for (let i = 9; i >= 0; i--) {
    if (i % 2 !== 0) {
        console.log(arr19[i]);
    }
}

// 5. перебрати циклом while в зворотньому порядку та вивести  числа тільки парні  значення
k = 9;
while (k >= 0) {
    if (k % 2 === 0) {
        console.log(arr19[k]);
    }
    k--;
}

// 6. перебрати циклом for в зворотньому порядку та вивести  числа тільки парні  значення
for (let i = 9; i >= 0; i--) {
    if (i % 2 === 0) {
        console.log(arr19[i])
    }
}

// 7. замінити кожне число кратне 3 на слово "okten" в зворотньому порядку

for (let i = 9; i >= 0; i--) {
    if (i % 3 === 0) {
        arr19[i] = "okten";

    }
}
console.log(arr19);

// 10 створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
let arr20 = [];
for (let i = 0; arr20.length < 50; i++) {
    let number = Math.random() * 100;
    number = Math.round(number);
    if (number % 2 === 0) {
        arr20.push(number);
    }
}
console.log(arr20);

// - заповнити його 50 непарними числами за допомоги циклу.
let arr21 = [];
for (let i = 0; arr21.length < 50; i++) {
    let number = Math.random() * 100;
    number = Math.round(number);
    if (number % 2 !== 0) {
        arr21.push(number);
    }
}
console.log(arr21);


// 1. Створити пустий масив та :

//     a. заповнити його 50 парними числами за допомоги циклу.
let arr22 = [];
for (let i = 0; arr22.length < 50; i++) {
    let number = Math.random() * 200;
    number = Math.round(number);
    if (number % 2 === 0) {
        arr22.unshift(number);
    }
}
console.log(arr22);

//     b. заповнити його 50 непарними числами за допомоги циклу.

let arr23 = [];
for (let i = 0; arr23.length < 50; i++) {
    let number = Math.random() * 200;
    number = Math.round(number);
    if (number % 2 !== 0) {
        arr23.unshift(number);
    }
}
console.log(arr23);


//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)

let arr24 = [];
for (let i = 0; arr24.length < 20; i++) {
    let number = Math.random() * 50;
    number = Math.round(number);
    arr24.push(number);
}
console.log(arr24);

// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

let arr25 = [];
for (let i = 0; arr25.length < 20; i++) {
    let number = Math.random() * (732 - 8) + 8;
    number = Math.round(number);
    arr25.push(number);
}
console.log(arr25);


// 2. Вивести за допомогою console.log кожен третій елемен
for (let i = 2; i < arr25.length; i += 3) {
    console.log(arr25[i]);
}

// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.

for (let i = 2; i < arr25.length; i += 3) {
    if (arr25[i] % 2 === 0) {
        console.log(arr25[i]);
    }
}

// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним
// та записати їх в новий масив

let arr26 = [];
for (let i = 2; i < arr25.length; i += 3) {
    if (arr25[i] % 2 === 0) {
        arr26.push(arr25[i]);
        console.log(arr25[i]);
    }
}
console.log(arr26);
// 5. Вивести кожен елемент масиву, сусід справа якого є парним

// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

let arr27 = [1, 2, 3, 5, 7, 9, 56, 8, 67];
for (let i = 1; i < arr27.length; i++) {
    if (arr27[i] % 2 === 0) {
        console.log(arr27[i - 1]);
    }
}


// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки.
// Обрахувати середній чек.

let check = 0;
let averageCheck = 0;

let cost = [100, 250, 50, 168, 120, 345, 188];
for (let costs of cost) {
    check += costs;
}
averageCheck = check / cost.length;
console.log(averageCheck);


// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

let random = [];
let randomMultipliedOn5 = [];
for (let i = 0; random.length < 20; i++) {
    let number = Math.random() * 50;
    number = Math.round(number);
    random.push(number);
    randomMultipliedOn5.push(random[i] * 5);
}
console.log(random);
console.log(randomMultipliedOn5);

// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому,
// і якщо елемент є числом - додати його в інший масив.

let arr28 = [1, "25", true, 60, 100, false, "Olga", 250, 500];
let newArr28 = [];
for (let value of arr28) {
    if (typeof value === "number") {
        newArr28.push(value);
    }
}
console.log(newArr28);


//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

let arr = ['a', 'b', 'c'];
let slovo = '';
for (let i = 0; i < 3; i++) {
    slovo += arr[i];
}
console.log(slovo);


// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

let arr100 = ['a', 'b', 'c'];
let slovo2 = '';
let i = 0;
while (i < arr100.length) {
    slovo2 += arr[i];
    i++
}
console.log(slovo2);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

let arr101 = ['a', 'b', 'c'];
let slovo3 = '';
for (const value of arr101) {
    slovo3 += value;
}
console.log(slovo3);